const regexpExpList = {
	字符匹配: [
		{
			code: "[abc]",
			desc: "字符集。匹配集合中所含的任一字符。",
		},
		{
			code: "[^abc]",
			desc: "否定字符集。匹配任何不在集合中的字符。",
		},
		{
			code: "[a-z]",
			desc: "字符范围。匹配指定范围内的任意字符。",
		},
		{
			code: ".",
			desc: "匹配除换行符以外的任何单个字符。",
		},
		{
			code: "\\",
			desc: "转义字符。",
		},
		{
			code: "\\w",
			desc: "匹配任何字母数字，包括下划线（等价于[A-Za-z0-9_]）。",
		},
		{
			code: "\\W",
			desc: "匹配任何非字母数字（等价于[^A-Za-z0-9_]）。",
		},
		{
			code: "\\d",
			desc: "数字。匹配任何数字。",
		},
		{
			code: "\\D",
			desc: "非数字。匹配任何非数字字符。",
		},
		{
			code: "\\s",
			desc: "空白。匹配任何空白字符，包括空格、制表符等。",
		},
		{
			code: "\\S",
			desc: "非空白。匹配任何非空白字符。",
		},
	],
	分组和引用: [
		{
			code: "(expression)",
			desc: "分组。匹配括号里的整个表达式。",
		},
		{
			code: "(?:expression)",
			desc: "非捕获分组。匹配括号里的整个字符串但不获取匹配结果，拿不到分组引用。",
		},
		{
			code: "\\num",
			desc: "对前面所匹配分组的引用。比如(\\d)\\1可以匹配两个相同的数字，(Code)(Sheep)\\1\\2则可以匹配CodeSheepCodeSheep。",
		},
	],
	锚点或边界: [
		{
			code: "^",
			desc: "匹配字符串或行开头。",
		},
		{
			code: "$",
			desc: "匹配字符串或行结尾。",
		},
		{
			code: "\\b",
			desc: "匹配单词边界。比如Sheep\\b可以匹配CodeSheep末尾的Sheep，不能匹配CodeSheepCode中的Sheep",
		},
		{
			code: "\\B",
			desc: "匹配非单词边界。比如Code\\B可以匹配HelloCodeSheep中的Code，不能匹配HelloCode中的Code。",
		},
	],
	数量匹配: [
		{
			code: "?",
			desc: "匹配前面的表达式0个或1个。即表示可选项。",
		},
		{
			code: "+",
			desc: "匹配前面的表达式至少1个。",
		},
		{
			code: "*",
			desc: "匹配前面的表达式0个或多个。",
		},
		{
			code: "|",
			desc: "或运算符。并集，可以匹配符号前后的表达式。",
		},
		{
			code: "{m}",
			desc: "匹配前面的表达式m个。",
		},
		{
			code: "{m,}",
			desc: "匹配前面的表达式最少m个。",
		},
		{
			code: "{m,n}",
			desc: "匹配前面的表达式最少m个，最多n个。",
		},
	],
	预查断言: [
		{
			code: "(?=)",
			desc: "正向预查。比如Code(?=Sheep)能匹配CodeSheep中的Code，但不能匹配CodePig中的Code。",
		},
		{
			code: "(?!)",
			desc: "正向否定预查。比如Code(?!Sheep)不能匹配CodeSheep中的Code，但能匹配CodePig中的Code。",
		},
		{
			code: "(?<=)",
			desc: "反向预查。比如(?<=Code)Sheep能匹配CodeSheep中的Sheep，但不能匹配ReadSheep中的Sheep。",
		},
		{
			code: "(?<!)",
			desc: "反向否定预查。比如(?<!Code)Sheep不能匹配CodeSheep中的Sheep，但能匹配ReadSheep中的Sheep。",
		},
	],
	特殊标志: [
		{
			code: "/.../i",
			desc: "忽略大小写。",
		},
		{
			code: "/.../g",
			desc: "全局匹配。",
		},
		{
			code: "/.../m",
			desc: "多行修饰符。用于多行匹配。",
		},
	],
	数字校验: [
		{
			code: "数字",
			desc: "^[0-9]*$",
		},
		{
			code: "n位数字",
			desc: "^\\d{n}$",
		},
		{
			code: "至少n位数字",
			desc: "^\\d{n,}$",
		},
		{
			code: "m~n位数字",
			desc: "^\\d{m,n}$",
		},
		{
			code: "整数",
			desc: "^(-?[1-9]\\d*)$",
		},
		{
			code: "正整数",
			desc: "^[1-9]\\d*$",
		},
		{
			code: "负整数",
			desc: "^-[1-9]\\d*$",
		},
		{
			code: "非负整数",
			desc: "^(([1-9]\\d*)|0)$",
		},
		{
			code: "非正整数",
			desc: "^((-[1-9]\\d*)|0)$",
		},
		{
			code: "浮点数",
			desc: "^-?(?:[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*|0\\.0+|0)$",
		},
		{
			code: "正浮点数",
			desc: "^(?:[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*)$",
		},
		{
			code: "负浮点数",
			desc: "^-(?:[1-9]\\d*\\.\\d*|0\\.\\d*[1-9]\\d*)$",
		},
		{
			code: "非正浮点数",
			desc: "^(?:-(?:[1-9]\\d*\\.\\d+|0\\.\\d*[1-9]\\d*)|0\\.0+|0)$",
		},
		{
			code: "非负浮点数",
			desc: "^(?:[1-9]\\d*\\.\\d+|0\\.\\d+|0\\.0+|0)$",
		},
		{
			code: "仅一位小数",
			desc: "^-?(?:0|[1-9][0-9]*)\\.[0-9]{1}$",
		},
		{
			code: "最少一位小数",
			desc: "^-?(?:0|[1-9][0-9]*)\\.[0-9]{1,}$",
		},
		{
			code: "最多两位小数",
			desc: "^-?(?:0|[1-9][0-9]*)\\.[0-9]{1,2}$",
		},
		{
			code: "连续重复的数字",
			desc: "^(\\d)\\1+$",
		},
	],
	字符校验: [
		{
			code: "中文",
			desc: "^[\\u4E00-\\u9FA5]+$",
		},
		{
			code: "全角字符",
			desc: "^[\\uFF00-\\uFFFF]+$",
		},
		{
			code: "半角字符",
			desc: "^[\\u0000-\\u00FF]+$",
		},
		{
			code: "英文字符串（大写）",
			desc: "^[A-Z]+$",
		},
		{
			code: "英文字符串（小写）",
			desc: "^[a-z]+$",
		},
		{
			code: "英文字符串（不区分大小写）",
			desc: "^[A-Za-z]+$",
		},
		{
			code: "中文和数字",
			desc: "^(?:[\\u4E00-\\u9FA5]{0,}|\\d)+$",
		},
		{
			code: "英文和数字",
			desc: "^[A-Za-z0-9]+$",
		},
		{
			code: "数字、英文字母或者下划线组成的字符串",
			desc: "^\\w+$",
		},
		{
			code: "中文、英文、数字包括下划线",
			desc: "^[\\u4E00-\\u9FA5\\w]+$",
		},
		{
			code: "不含字母的字符串",
			desc: "^[^A-Za-z]*$",
		},
		{
			code: "连续重复的字符串",
			desc: "^(.)\\1+$",
		},
		{
			code: "长度为n的字符串",
			desc: "^.{n}$",
		},
		{
			code: "ASCII",
			desc: "^[ -~]$",
		},
	],
	日期和时间校验: [
		{
			code: "日期",
			desc: "^\\d{1,4}-(?:1[0-2]|0?[1-9])-(?:0?[1-9]|[1-2]\\d|30|31)$",
		},
		{
			code: "日期",
			desc: "^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$",
		},
		{
			code: "时间",
			desc: "^(?:1[0-2]|0?[1-9]):[0-5]\\d:[0-5]\\d$",
		},
		{
			code: "时间",
			desc: "^(?:[01]\\d|2[0-3]):[0-5]\\d:[0-5]\\d$",
		},
		{
			code: "日期+时间",
			desc: "^(\\d{1,4}-(?:1[0-2]|0?[1-9])-(?:0?[1-9]|[1-2]\\d|30|31)) ((?:[01]\\d|2[0-3]):[0-5]\\d:[0-5]\\d)$",
		},
	],
	日常生活相关: [
		{
			code: "中文名",
			desc: "^[\\u4E00-\\u9FA5·]{2,16}$",
		},
		{
			code: "英文名",
			desc: "^[a-zA-Z][a-zA-Z\\s]{0,20}[a-zA-Z]$",
		},
		{
			code: "车牌号",
			desc: "^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳]$",
		},
		{
			code: "车牌号",
			desc: "^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z](?:(?:[A-HJ-NP-Z0-9]{4}[A-HJ-NP-Z0-9挂学警港澳])|(?:(?:\\d{5}[A-HJK])|(?:[A-HJK][A-HJ-NP-Z0-9][0-9]{4})))$",
		},
		{
			code: "火车车次",
			desc: "^[GCDZTSPKXLY1-9]\\d{1,4}$",
		},
		{
			code: "手机号",
			desc: "^(?:(?:\\+|00)86)?1[3-9]\\d{9}$",
		},
		{
			code: "手机号",
			desc: "^(?:(?:\\+|00)86)?1(?:(?:3[\\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\\d])|(?:9[189]))\\d{8}$",
		},
		{
			code: "固话号码",
			desc: "^(?:(?:\\d{3}-)?\\d{8}|^(?:\\d{4}-)?\\d{7,8})(?:-\\d+)?$",
		},
		{
			code: "手机IMEI码",
			desc: "^\\d{15,17}$",
		},
		{
			code: "邮编",
			desc: "^(?:0[1-7]|1[0-356]|2[0-7]|3[0-6]|4[0-7]|5[1-7]|6[1-7]|7[0-5]|8[013-6])\\d{4}$",
		},
		{
			code: "统一社会信用代码",
			desc: "^[0-9A-HJ-NPQRTUWXY]{2}\\d{6}[0-9A-HJ-NPQRTUWXY]{10}$",
		},
		{
			code: "身份证号码(1代)",
			desc: "^[1-9]\\d{7}(?:0\\d|10|11|12)(?:0[1-9]|[1-2][\\d]|30|31)\\d{3}$",
		},
		{
			code: "身份证号码(2代)",
			desc: "^[1-9]\\d{5}(?:18|19|20)\\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\\d|30|31)\\d{3}[0-9Xx]$",
		},
		{
			code: "QQ号",
			desc: "^[1-9][0-9]{4,}$",
		},
		{
			code: "微信号",
			desc: "^[a-zA-Z][-_a-zA-Z0-9]{5,19}$",
		},
		{
			code: "股票代码",
			desc: "^(s[hz]|S[HZ])(000[\\d]{3}|002[\\d]{3}|300[\\d]{3}|600[\\d]{3}|60[\\d]{4})$",
		},
		{
			code: "银行卡卡号",
			desc: "^[1-9]{1}(?:\\d{15}|\\d{18})$",
		},
	],
	互联网相关: [
		{
			code: "域名",
			desc: "^[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(?:\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+$",
		},
		{
			code: "网址",
			desc: "^(?:https?:\\/\\/)?[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(?:\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+$",
		},
		{
			code: "带端口号的网址(或IP)",
			desc: "^(?:https?:\\/\\/)?[\\w-]+(?:\\.[\\w-]+)+:\\d{1,5}\\/?$",
		},
		{
			code: "URL",
			desc: "^https?:\\/\\/(?:www\\.)?[-a-zA-Z0-9@:%._\\+~#=]{1,256}\\.[a-zA-Z0-9()]{1,6}\\b(?:[-a-zA-Z0-9()!@:%_\\+.~#?&\\/\\/=]*)$",
		},
		{
			code: "邮箱email",
			desc: "^[A-Za-z0-9\\u4e00-\\u9fa5]+@[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(?:\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+$",
		},
		{
			code: "用户名",
			desc: "^[a-zA-Z0-9_-]{4,20}$",
		},
		{
			code: "弱密码",
			desc: "^[\\w]{6,16}$",
		},
		{
			code: "强密码",
			desc: "^.*(?=.{6,})(?=.*\\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@\\.#$%^&*? ]).*$",
		},
		{
			code: "端口号",
			desc: "^(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5])$",
		},
		{
			code: "IPv4地址",
			desc: "^(?:(?:\\d|[1-9]\\d|1\\d\\d|2[0-4]\\d|25[0-5])\\.){3}(?:\\d|[1-9]\\d|1\\d\\d|2[0-4]\\d|25[0-5])$",
		},
		{
			code: "IPv4地址+端口",
			desc: "^(?:(?:\\d|[1-9]\\d|1\\d\\d|2[0-4]\\d|25[0-5])\\.){3}(?:\\d|[1-9]\\d|1\\d\\d|2[0-4]\\d|25[0-5])(?::(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]))?$",
		},
		{
			code: "IPv6地址",
			desc: "^(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))$",
		},
		{
			code: "IPv6地址+端口",
			desc: "^\\[(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9]))\\](?::(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]))?$",
		},
		{
			code: "子网掩码",
			desc: "^(?:254|252|248|240|224|192|128)\\.0\\.0\\.0|255\\.(?:254|252|248|240|224|192|128|0)\\.0\\.0|255\\.255\\.(?:254|252|248|240|224|192|128|0)\\.0|255\\.255\\.255\\.(?:255|254|252|248|240|224|192|128|0)$",
		},
		{
			code: "MAC地址",
			desc: "^(?:(?:[a-f0-9A-F]{2}:){5}|(?:[a-f0-9A-F]{2}-){5})[a-f0-9A-F]{2}$",
		},
		{
			code: "Version版本号",
			desc: "^\\d+(?:\\.\\d+){2}$",
		},
		{
			code: "图片后缀",
			desc: "\\.(gif|png|jpg|jpeg|webp|svg|psd|bmp|tif)+",
		},
		{
			code: "视频后缀",
			desc: "\\.(swf|avi|flv|mpg|rm|mov|wav|asf|3gp|mkv|rmvb|mp4)+",
		},
		{
			code: "图片链接",
			desc: "(?:https?:\\/\\/)?[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(?:\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+.+\\.(gif|png|jpg|jpeg|webp|svg|psd|bmp|tif)",
		},
		{
			code: "视频链接",
			desc: "(?:https?:\\/\\/)?[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(?:\\.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+.+\\.(swf|avi|flv|mpg|rm|mov|wav|asf|3gp|mkv|rmvb|mp4)",
		},
		{
			code: "迅雷链接",
			desc: "thunderx?:\\/\\/[a-zA-Z\\d]+=",
		},
		{
			code: "ed2k链接",
			desc: "ed2k:\\/\\/\\|file\\|.+\\|\\/",
		},
		{
			code: "磁力链接",
			desc: "magnet:\\?xt=urn:btih:[0-9a-fA-F]{40,}.*",
		},
	],
	其他: [
		{
			code: "MD5格式",
			desc: "^(?:[a-f\\d]{32}|[A-F\\d]{32})$",
		},
		{
			code: "BASE64格式",
			desc: "^\\s*data:(?:[a-z]+\\/[a-z0-9-+.]+(?:;[a-z-]+=[a-z0-9-]+)?)?(?:;base64)?,([a-z0-9!$&',()*+;=\\-._~:@/?%\\s]*?)\\s*$",
		},
		{
			code: "UUID",
			desc: "^[a-f\\d]{4}(?:[a-f\\d]{4}-){4}[a-f\\d]{12}$",
		},
		{
			code: "16进制",
			desc: "^[A-Fa-f0-9]+$",
		},
		{
			code: "16进制颜色",
			desc: "^#?([0-9a-fA-F]{3}|[0-9a-fA-F]{6})$",
		},
		{
			code: "SQL语句",
			desc: "^(?:select|drop|delete|create|update|insert).*$",
		},
		{
			code: "Java包名",
			desc: "^(?:[a-zA-Z_]\\w*)+(?:[.][a-zA-Z_]\\w*)+$",
		},
		{
			code: "文件扩展名",
			desc: "\\.(?:doc|pdf|txt)",
		},
		{
			code: "Windows文件路径",
			desc: "^[a-zA-Z]:(?:\\\\[\\w\\u4E00-\\u9FA5\\s]+)+[.\\w\\u4E00-\\u9FA5\\s]+$",
		},
		{
			code: "Windows文件夹路径",
			desc: "^[a-zA-Z]:(?:\\\\[\\w\\u4E00-\\u9FA5\\s]+)+$",
		},
		{
			code: "Linux文件路径",
			desc: "^\\/(?:[^/]+\\/)*[^/]+$",
		},
		{
			code: "Linux文件夹路径",
			desc: "^\\/(?:[^/]+\\/)*$",
		},
	],
};
export default regexpExpList;

